app/views/doogle/search.js.erb

$('<% @sprites.each do |sprite| %><img src = "<%= sprite %>" width = "30%"><% end %><br>').appendTo('#definitions');
$('<% @definitions.each do |definition| %><p class = "definition"><%= definition %></p><% end %>').appendTo('#definitions');
---
SELECT `definitions`.* FROM `definitions`