app/controllers/doogle_controller.rb

SELECT  `words`.* FROM `words` WHERE `words`.`content` = 'word' LIMIT 1
SELECT `definitions`.* FROM `definitions` WHERE `definitions`.`word_id` = 1
INSERT INTO `definitions` (`content`, `word_id`, `created_at`, `updated_at`) VALUES (':one who commits or practices piracy', 7, '2016-07-27 23:45:24', '2016-07-27 23:45:24')
INSERT INTO `sprites` (`content`, `word_id`, `created_at`, `updated_at`) VALUES ('http://pokeapi.co/media/img/25.png', 1, '2016-07-28 06:26:16', '2016-07-28 06:26:16')
INSERT INTO `words` (`content`, `created_at`, `updated_at`) VALUES ('word', '2016-07-21 18:34:14', '2016-07-21 18:34:14')
SELECT `sprites`.* FROM `sprites` WHERE `sprites`.`word_id` = 3
---
  def search
    input = params[:word_entry][:word]
    @word = Word.find_by(content: input)

    #if word is already in database
    if(@word != nil)

      @definitions = format_data(@word.definitions)
      @sprites = format_data(@word.sprites)
      @validation_text = ''

    #if word is not already in database
    else
      @word = Word.new()
      @word.content = params[:word_entry][:word]

      if(@word.valid?)
        @data = get_word_definitions_from_api(@word.content)
        @definitions = @data['definitions']
        @sprites = @data['sprites']

        if (@definitions != nil && @definitions.length > 0 )
          @word.save
          save_definitions(@word, @definitions)
          if(@sprites != nil && @sprites.length > 0)